app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-04-30 20:40:39.611309"], ["updated_at", "2018-04-30 20:40:39.611309"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 1], ["created_at", "2018-04-30 20:40:39.619349"], ["updated_at", "2018-04-30 20:40:39.619349"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      artist = Artist.find_or_create_by(name: song[1])